Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཅང་མི་སྨྲ་བས་ཐོབ་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as attainment through not speaking.

source: བརྩོན་འགྲུས་ལ་རེག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as contacting diligence.

source: ཡིད་དུ་འོང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as beautiful diligence.

source: ཐོབ་པར་རྩོམ་ཞིང་ངེས་པར་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as endeavoring for the sake of attainment and deliverance.

source: ངེས་པ་ལ་ཆོག་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as contentment with certainty.

source: ཡོངས་སུ་བསྔོ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the subsequent dedication of all.

source: འདི་དག་ནི་བརྩོན་འགྲུས་སྤོང་བའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the diligence-suffused base of miraculous power.

source: དེ་ལ་སེམས་སྤོང་བའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the attention-suffused base of miraculous power?

source: སེམས་ལ་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the realization of equality in the mind.

source: དེ་ལ་མི་དགའ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being free from any displeasure regarding that.

source: སྐྱེ་བ་དང་འཇིག་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as realizing arising and ceasing.

source: མཚན་མ་མེད་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the attainment of the absence of marks.

source: སེམས་ཀུན་ནས་དཀྲིས་པ་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the mind being free from fetters.

source: བག་ལ་ཉལ་ཀུན་ནས་འཇོམས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the destruction of latencies.

source: འདི་དག་ནི་སེམས་སྤོང་བའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the attention-suffused base of miraculous power.

source: དེ་ལ་དཔྱོད་པ་སྤོང་བའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the analysis-enriched base of miraculous power?

source: དཔྱོད་པ་ལ་མི་དགའ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as not being displeased with analysis.

source: ཡང་དག་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the attainment of reality.

source: རིག་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the realization of knowledge.

source: རྣམ་པར་གནོན་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as thoroughgoing elimination.

source: བག་ཆགས་ཁོང་དུ་ཆུད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the comprehension of karmic imprints.

source: བག་ཆགས་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the relinquishment of karmic imprints.

source: འདི་དག་ནི་དཔྱོད་པ་སྤོང་བའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the analysis-enriched base of miraculous power.

source: དེ་ལ་བསམ་གཏན་དང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the first concentration?

source: དམིགས་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the attainment of focus.

source: ཁྱིམ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding of the household.

source: བསམ་གཏན་དང་པོ་མ་ཉམས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the equality of the first concentration.

source: ཡན་ལག་ལྔ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the relinquishment of the five branches.

source: རྩེ་གཅིག་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the attainment of one-pointedness.

source: ཡན་ལག་ལྔ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the possession of the five branches.

source: འདི་དག་ནི་བསམ་གཏན་དང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the first concentration.

source: དེ་ལ་བསམ་གཏན་གཉིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the second concentration?

source: བསམ་གཏན་གཉིས་པ་ལ་མཚན་མར་འཛིན་པ་སྤོང་ཞིང་ཤིན་ཏུ་སྦྱངས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as giving up the grasping onto marks and achieving ease.

source: བར་ཆད་མེད་པར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the cognition devoid of obstacles.

source: རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as realization.

source: ཤུགས་མི་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as not letting the momentum dissipate.

source: ཐར་པ་ལ་དམིགས་ཤིང་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as focusing on liberation and entering meditative attainment.

source: བདག་དང་གཞན་ལ་ཕན་པ་དང་ལྡན་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing endowed with benefit for oneself and others.

source: འདི་དག་ནི་བསམ་གཏན་གཉིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the second concentration.

source: དེ་ལ་བསམ་གཏན་གསུམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the third concentration?

source: བསམ་གཏན་གསུམ་པའི་རོ་མྱང་བ་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as giving up relishing the third concentration.

source: རོ་མྱང་བ་མེད་པ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Diligence ripens as delighting in the absence of relishing.

source: དགའ་བ་དོན་དུ་གཉེར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the pursuit of happiness.

source: ཀུན་ནས་འཛིན་ཅིང་མ་བརྗེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as retaining everything without forgetting.

source: བློ་བརྟན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as a stable mind.

source: ཟག་པ་ཟད་པའི་རྒྱུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the cause of the exhaustion of contaminants.

source: འདི་དག་ནི་བསམ་གཏན་གསུམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the third concentration.

source: དེ་ལ་བསམ་གཏན་བཞི་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the fourth concentration?

source: བསམ་གཏན་བཞི་པའི་བདེ་བ་ལ་རྟོག་ཅིང་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding the pleasure of the fourth concentration and giving it up.

source: སྡུག་བསྔལ་ལ་རྟོག་ཅིང་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding suffering and giving it up.

source: ནུབ་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the understanding of disappearance.

source: བཏང་སྙོམས་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the attainment of equanimity.

source: དྲན་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the attainment of recollection.

source: ཡོངས་སུ་དག་པ་ཐོབ་ནས་འཆི་བ་མེད་པར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as attaining complete purity and dedicating that to immortality.

source: འདི་དག་ནི་བསམ་གཏན་བཞི་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the fourth concentration.

source: དེ་ལ་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “There are six perfections for each of the four applications of mindfulness.

source: དེ་ལ་ལུས་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཡང་གང་ཞེ་ན།
en: What are the six perfections of the application of mindfulness with respect to the body?

source: ལུས་ལ་མི་སྡུག་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the understanding that the body is repulsive.

source: དེ་ལ་རྟོག་པ་ལ་མི་ལྟ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as not being concerned with thoughts about that.

source: བདག་མེད་པ་ལ་མོས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being motivated by the absence of self.

source: གཡོ་བ་མེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as unwavering seeing.

source: ངོ་བོ་ཉིད་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing the essential nature.

source: སྐྱེ་བ་མེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the perception of nonarising.

source: འདི་དག་ནི་ལུས་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the application of mindfulness with respect to the body.

source: དེ་ལ་ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the application of mindfulness with respect to sensations?

source: བདེ་བའི་ཚོར་བ་ལ་ལྷག་པར་ཆགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity ripens as absence of desire with respect to pleasant sensations.

source: ཚོར་བ་སྡུག་བསྔལ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the perception of sensations as suffering.

source: སྟོང་པ་ཉིད་ལ་མོས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being motivated by the absence of self.

source: ཚོར་བ་ལ་མངོན་པར་ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as nonattachment to sensations.

source: བདེ་བའི་ཚོར་བ་ལ་མི་བལྟ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as disregard for pleasant sensations.

source: ཚོར་བ་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the relinquishment of all sensations by way of equality.

source: འདི་དག་ནི་ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the application of mindfulness with respect to sensations.

source: དེ་ལ་སེམས་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the application of mindfulness with respect to the mind?

source: སྤོང་བ་ལ་དམིགས་པའི་སེམས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the seeing of a mind focused on relinquishment.

source: སེམས་དེའི་སྐྱོན་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the flaws of that mind.

source: གཡོ་བ་མེད་པ་ལ་རྣམ་པར་དཔྱོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as discerning the unmoving.

source: སེམས་ཀྱི་སྤྱོད་ཡུལ་ཡ་ང་བ་ཟློག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as turning back all the objects of the mind.

source: གཞན་གྱི་ཕྱིར་སེམས་དགའ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as rejoicing for the sake of others.

source: རྐྱེན་ལ་རག་ལས་པ་མཐོང་ནས་མཚན་མ་མེད་པ་སྒོམ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as meditation without marks based on having seen the dependence on conditions.

source: འདི་དག་ནི་སེམས་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the application of mindfulness with respect to the mind.

source: དེ་ལ་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the application of mindfulness with respect to phenomena?

source: ཆོས་རྣམས་ཀྱི་རྣམ་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity is seeing the features of phenomena.

source: ཆོས་རྣམས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as thinking of phenomena.

source: ཆོས་རྣམས་སྐྱེ་བས་དབེན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the nonarising of phenomena.

source: ཆོས་རྣམས་ལ་ལྟ་བ་མཆོག་ཏུ་འཛིན་པ་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as giving up holding a view to be paramount.

source: ཆོས་རྣམས་ལ་མངོན་པར་ཞེན་པ་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the relinquishment of attachment to phenomena.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing dependent origination.

source: འདི་དག་ནི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ།། །།
en: Such are the six perfections of the application of mindfulness with respect to phenomena.

source: དེ་ལ་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of seeing the truth of the noble ones relating to suffering?

source: སྡུག་བསྔལ་ཡོངས་སུ་གཏོང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing that has thoroughly given up suffering.

source: སྡུག་བསྔལ་ལ་ཡིད་བྱུང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the disenchanting character of suffering.

source: སྡུག་བསྔལ་གསོབ་ཏུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the insubstantiality of suffering.

source: སྡུག་བསྔལ་ཆེན་པོར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing the immensity of suffering.

source: སྡུག་བསྔལ་གྱི་རང་བཞིན་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing the nature of suffering.

source: སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as full knowledge of suffering.

source: འདི་དག་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of seeing the truth of the noble ones relating to suffering.

source: དེ་ལ་ཀུན་འབྱུང་བའི་བདེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the truth of the origin?

source: ཀུན་འབྱུང་བ་ཡོངས་སུ་གཏོང་བའི་སེམས་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the mind that relinquishes the origin.

source: ཀུན་འབྱུང་བའི་ཉེས་དམིགས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the defects of the origin.

source: ཚོགས་པ་ལས་བྱུང་བ་ལ་དཔྱོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as discerning the manifold sources.

source: སྲེད་པའི་འཁོར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing the cycle of craving.

source: ཀུན་ནས་དཀྲིས་པ་དང་། བག་ལ་ཉལ་བ་འཇོམས་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing that overcomes all entanglements and their latent dispositions.

source: ངེས་པར་སྤོང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing that relinquishes.

source: འདི་དག་ནི་ཀུན་འབྱུང་བའི་བདེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the truth of the origin.

source: དེ་ལ་འགོག་པའི་བདེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the truth of cessation?

source: འགོག་པ་ལ་རེག་པར་བྱས་ནས་སྨོན་པ་མེད་པ་སྒོམ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as reaching cessation and practicing without wishes.

source: འགོག་པ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as delighting in cessation.

source: འདུ་ཤེས་འགོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the cessation of conceptions.

source: ཚོར་བ་འགོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the cessation of sensation.

source: དབེན་པ་ལ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as applying oneself to disengagement.

source: འགོག་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as meditative attainment for the sake of actualizing cessation.

source: འདི་དག་ནི་འགོག་པའི་བདེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the truth of cessation.

source: དེ་ལ་ལམ་གྱི་བདེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the truth of the path?

source: ལམ་གྱི་གྲོགས་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as finding helpers on the path.

source: ལམ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as delighting in the path.

source: ལམ་གཞན་མ་ཡིན་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the suchness of there being no other path.

source: ལམ་གྱི་དམིགས་པ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as retaining the apprehension of the path.

source: ལམ་ལ་མ་རྨོངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being undeluded regarding the path.

source: ཆོས་ཐམས་ཅད་དངོས་པོ་ཇི་ལྟ་བ་བཞིན་ལམ་གྱིས་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as knowledge by means of the path, whereby all phenomena are seen exactly as they are.

source: འདི་དག་ནི་ལམ་གྱི་བདེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the truth of cessation.

source: དེ་ལ་དད་པའི་དབང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the power of faith?

source: དད་ནས་ཚུལ་ཁྲིམས་འཆལ་པ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as faithfully giving up flawed discipline.

source: དད་པས་རྗེས་སུ་སྒོམ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as training based on faith.

source: དད་པ་ལ་མཆོག་ཏུ་དགའ་བ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the attainment of great delight in faith.

source: དད་པའི་གནས་ཡང་དག་པ་ཀུན་ནས་རབ་ཏུ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the accurate and thorough grasp of the supports for faith.

source: ཐར་པའི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་དད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as faith associated with the power of liberation.

source: བྱང་ཆུབ་ཀྱི་སྣོད་དུ་གྱུར་པའི་དད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as faith that is the vessel for awakening.

source: འདི་དག་ནི་དད་པའི་དབང་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the power of faith.

source: དེ་ལ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the power of diligence?

source: བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཡིད་ལ་གཅགས་པ་མེད་ཅིང་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as having no attachment to the power of diligence and being capable of overpowering others.

source: འདུས་བྱས་ལ་ལྷག་པར་ཞེན་པ་མེད་ཅིང་འདུས་མ་བྱས་ལ་བལྟ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being free from attachment to conditioned things and looking toward the unconditioned.

source: བྱ་བ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being unimpeded in all activities.

source: ཐག་རིང་པོར་ཡོངས་སུ་བསྔོ་བའི་སྨོན་ལམ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as an aspiration of far-reaching dedication.

source: དུས་དང་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as timely diligence.

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་དེའི་ངོ་བོ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the essence of mundane and supramundane phenomena.

source: འདི་དག་ནི་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of diligence.

source: དེ་ལ་དྲན་པའི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of mindfulness?

source: ཡང་དག་པ་མཐོང་ནས་ཁྱིམ་ཡོངས་སུ་འཛིན་པའི་སྐྱོན་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as giving up the flaws of keeping a household, based on seeing reality.

source: འདུས་བྱས་ཀྱི་འབྲས་བུ་དང་འཇིག་རྟེན་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding the effects of conditioned things and understanding the world.

source: ཉོན་མོངས་པས་སྐྱོ་བ་མེད་ཅིང་སྡུག་བསྔལ་བར་མི་སེམས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being undeterred by suffering and not considering things to be painful.

source: ཆོས་རྣམས་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as retaining the Dharma teachings.

source: ཉེ་བར་ཞི་བ་དག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as pure pacification.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་རྣམས་ཀྱིས་རྒྱས་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as making all sentient beings progress by way of the Dharma teachings.

source: འདི་དག་ནི་དྲན་པའི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of mindfulness.

source: དེ་ལ་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of absorption?

source: ཚེགས་ཆུང་ངུས་ཉེ་བའི་ཉོན་མོངས་པ་འདོར་བའི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the power of absorption that discards the subsidiary defilements with minimal hardship.

source: ཏིང་ངེ་འཛིན་ལ་བརྟེན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as reliance on absorption.

source: ཏིང་ངེ་འཛིན་ཤིན་ཏུ་གནས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as stable abiding by absorption.

source: ཆོས་རྣམས་ཀྱི་རྣམ་པ་ལ་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as apprehending the features of the Dharma.

source: ཏིང་ངེ་འཛིན་རྩེ་གཅིག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as one-pointed absorption.

source: ཏིང་ངེ་འཛིན་སྟོབས་ཅན་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as powerful absorption.

source: འདི་དག་ནི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of absorption.

source: དེ་ལ་ཤེས་རབ་ཀྱི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of insight?

source: དངོས་པོ་ཐམས་ཅད་བརྟགས་ནས་སྤོང་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the insight that abandons all entities based on analysis.

source: མངོན་པར་ཞེན་པ་མེད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as insight free of attachment.

source: སེམས་ཅན་གྱི་ཉོན་མོངས་པ་བཟོད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as insight that patiently accepts the defilements of sentient beings.

source: རང་བཞིན་གྱིས་རྟོགས་པ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as insight that naturally retains understanding.

source: ཉེ་བར་ཞི་བ་ལ་དམིགས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as insight focused on quelling.

source: ཐར་པ་མི་སྒྲུབ་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as insight that does not engage in liberation.

source: འདི་དག་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of insight.

source: དེ་ལ་དད་པའི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of faith?

source: དད་པ་མི་འཕྲོགས་པ་ནི་དཔེར་ན་རྒྱལ་པོ་གཞོན་ནུ་སེང་གེའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as inalienable faith, as exemplified by the king Youthful Lion.

source: ཚུལ་ཁྲིམས་ཀྱིས་བསྒོས་པ་མ་ཉམས་པ་ནི། དཔེར་ན་གླང་པོ་ཆེའི་ཕྲུ་གུས་མ་ལོང་མ་དྲན་ནས་ཟས་མི་ཟ་བ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the discipline of not contravening directives, just like the elephant calf that refrained from eating because of remembering its blind mother.

source: རུས་པ་སོ་སོར་གྱེས་ཀྱང་བྱམས་པ་མི་གཏོང་བ་ནི་དཔེར་ན་སྲོག་ཆགས་སུ་གྱུར་པ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as never giving up love, even if one’s bones are split apart, as exemplified by the bodhisattva Śānta in his relations with living beings.

source: ཐོགས་པ་མེད་པའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་སྐམས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as unstoppable diligence, as illustrated by the example of drying up the ocean.

source: ཆོས་བཟང་གི་ཁང་བཟངས་སུ་བསམ་གཏན་སྐྱེད་པ་ན་རྣམ་པར་རྟོག་པ་རྣམས་འཇོག་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the placement of thoughts as one develops concentration in the palace of Sudharma.

source: འཕགས་པ་ངེས་པར་འབྱུང་བའི་ཤེས་རབ་ནི་དཔེར་ན་བརྩོན་འགྲུས་སྤྱོད་པའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the noble insight of deliverance, just as shown in the practice of diligence.

source: འདི་དག་ནི་དད་པའི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of faith.

source: དེ་ལ་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of diligence?
